const enemyBaseDef = [36, 40, 43, 45, 46, 50, 54, 58, 60]
const levelCoefficient = [1,1.08,1.16,1.24,1.32,1.42,1.52,1.64,1.76,1.88,2,2.14,2.28,2.42,2.58,2.74,2.9,3.06,3.24,3.44,3.62,3.82,4.02,4.22,4.44,4.66,4.9,5.12,5.36,5.62,5.86,6.12,6.38,6.66,6.94,7.22,7.5,7.8,8.1,8.42,8.72,9.04,9.38,9.7,10.04,10.38,10.74,11.1,11.46,11.84,12.2,12.58,12.98,13.38,13.78,14.18,14.6,15.02,15.44,15.88]

const agentDataCSV = `
0,Stun,A,Electric,,,アンビー・デマラ,7500,583,612,118,5,50,94,93,0,1.2,imp,6,atk,25,0
1,Attack,A,Physical,,,ビリー・キッド,6907,712,606,91,5,50,92,91,0,1.2,critR,4.8,atk,25,28
2,Support,A,Ether,,,ニコ・デマラ,8145,574,622,80,5,50,90,93,0,1.2,enReg,0.12,atk,25,26
3,Attack,S,Physical,,,猫宮又奈,7560,835,587,92,5,50,97,96,0,1.2,critR,4.8,atk,25,35
4,Attack,S,Fire,,,「11号」,7673,813,612,93,5,50,94,93,0,1.2,critR,4.8,atk,25,36
5,Attack,A,Physical,,,カリン・ウィクス,6976,732,604,93,5,50,93,96,0,1.2,critD,9.6,atk,25,27
6,Attack,A,Electric,,,アンドー・イワノフ,7219,716,622,95,5,50,86,90,0,1.2,critR,4.8,atk,25,29
7,Defense,A,Fire,,,ベン・ビガー,8577,867,724,95,5,50,86,90,0,1.2,enReg,0.12,atk,25,30
8,Stun,S,Fire,,,クレタ・ベロボーグ,8127,660,594,116,5,50,97,96,0,1.2,imp,6,atk,25,37
9,Anomaly,S,Electric,,,グレース・ハワード,7482,750,600,83,5,50,115,116,0,1.2,anmB,12,atk,25,39
10,Stun,S,Ice,,,フォン・ライカン,8416,653,606,119,5,50,91,90,0,1.2,imp,6,atk,25,38
11,Attack,S,Ice,,,エレン・ジョー,7673,863,606,93,5,50,94,93,0,1.2,critR,4.8,atk,25,40
12,Support,S,Electric,,,アレクサンドリナ・セバスチャン,8609,642,600,83,5,50,93,92,0,1.2,penP,4.8,atk,25,41
13,Attack,S,Ether,,,朱鳶,7482,844,600,90,5,50,93,92,0,1.2,critD,9.6,atk,25,42
14,Support,A,Ice,,,蒼角,8025,590,597,86,5,50,93,96,0,1.2,enReg,0.12,atk,25,31
15,Support,A,Fire,,,ルシアーナ・デ・モンテフィーノ,8025,583,612,86,5,50,94,93,0,1.2,enReg,0.12,atk,25,43
16,Anomaly,A,Physical,,,パイパー・ウィール,6976,683,612,86,5,50,116,118,0,1.2,enReg,0.12,atk,25,44
17,Stun,S,Electric,,,青衣,8250,683,612,118,5,50,94,93,0,1.2,imp,6,atk,25,46
18,Anomaly,S,Physical,,,ジェーン・ドゥ,7788,805,606,89,5,50,112,114,0,1.2,anmB,12,atk,25,47
19,Defense,A,Electric,,,セス・ローウェル,8701,568,746,94,5,50,86,90,0,1.2,enReg,0.12,atk,25,48
20,Defense,S,Physical,,,キング・シーザー,9526,636,753,105,5,50,87,90,0,1.2,imp,6,atk,25,49
21,Anomaly,S,Fire,,,バーニス・ホワイト,7368,788,600,83,5,50,118,120,0,1.2,enReg,0.12,atk,25,50
22,Anomaly,S,Electric,,,月城柳,7788,797,612,86,5,50,112,114,0,1.2,anmB,12,atk,25,51
23,Stun,S,Fire,,,ライト,8253,722,612,119,5,50,91,90,0,1.2,imp,6,atk,25,52
24,Anomaly,S,Ice,Frost,,星見雅,7673,805,606,86,5,50,116,148,0,1.2,anmP,30,atk,25,54
25,Attack,S,Electric,,,浅羽悠真,7405,840,600,90,5,50,80,95,0,1.2,critR,4.8,atk,25,55
26,Support,S,Ether,,,アストラ・ヤオ,8609,640,600,83,5,50,93,92,0,1.2,enReg,0.12,atk,25,56
27,Attack,S,Fire,,,イヴリン・シュヴァリエ,7788,854,612,93,5,50,92,90,0,1.2,critR,4.8,atk,25,57
28,Attack,S,Electric,,Soldier 0 – Anby,0号・アンビー,7673,854,612,93,5,50,94,93,0,1.2,critR,4.8,atk,25,58
29,Stun,A,Physical,,Pulchra Fellini,プルクラ・フェリーニ,7612,590,606,118,5,50,92,90,0,1.2,imp,6,atk,25,59
`

const wEngineDataCSV = `
0,Stun,A,Demara Battery Mark II,デマラ式電池Ⅱ型,42,624,imp-p,15,bonus-ele,15,17.5,20,22,24,,,,,,,,,電気属性ダメージ+15/17.5/20/22/24%。『回避反撃』または『支援攻撃』が敵に命中した時、装備者のエネルギー獲得効率+18/20.5/23/25/27.5%、継続時間8秒。
1,Attack,B,[Lunar] Pleniluna,「月相」‐望,32,475,atk-p,20,,,,,,,,,,,,,,,『通常攻撃』、『ダッシュ攻撃』、『回避反撃』の与ダメージ+12/14/16/18/20%。
2,Attack,B,[Lunar] Decresent,「月相」‐晦,32,475,atk-p,20,,,,,,,,,,,,,,,『連携スキル』または『終結スキル』を発動すると、装備者の与ダメージ+15/17.5/20/22.5/25%。継続時間6秒。
3,Attack,B,[Lunar] Noviluna,「月相」‐朔,32,475,crit-r,16,,,,,,,,,,,,,,,『強化特殊スキル』を発動すると、装備者のエネルギー3/3.5/4/4.5/5Pt回復する、12秒に1回のみ発動可能。
4,Support,B,[Reverb] Mark I,「残響」‐Ⅰ型,32,475,atk-p,20,,,,,,,,,,,,,,,『強化特殊スキル』を発動すると、チーム全体の衝撃力+8/9/10/11/12%、継続時間10秒。20秒に1回のみ発動可能。同じパッシブ効果は重ね掛け不可。
5,Support,B,[Reverb] Mark II,「残響」‐Ⅱ型,32,475,en-reg,40,,,,,,,,,,,,,,,『強化特殊スキル』または『連携スキル』を発動すると、チーム全体の異常掌握と異常マスタリー+10/12/13/15/16Pt、継続時間10秒。20秒に1回のみ発動可能。同じパッシブ効果は重ね掛け不可。
6,Support,B,[Reverb] Mark III,「残響」‐Ⅲ型,32,475,hp-p,20,,,,,,,,,,,,,,,『連携スキル』または『終結スキル』を発動すると、チーム全体の攻撃力+8/9/10/11/12%、継続時間10秒。20秒に1回のみ発動可能。同じパッシブ効果は重ね掛け不可。
7,Stun,B,[Vortex] Revolver,「激流」‐銃型,32,475,atk-p,20,,,,,,,,,,,,,,,『強化特殊スキル』の与えるブレイク値+10/11.5/13/14.5/16%。
8,Stun,B,[Vortex] Arrow,「激流」‐矢型,32,475,imp-p,12,,,,,,,,,,,,,,,攻撃が敵に命中すると、装備者がメインターゲットに与えるブレイク値+8/9/10/11/12%。
9,Stun,B,[Vortex] Hatchet,「激流」‐斧型,32,475,en-reg,40,,,,,,,,,,,,,,,接敵状態突入時、または出場した時、装備者の衝撃力+9/10/11/12/13%、継続時間10秒。20秒に1回のみ発動可能。
10,Anomaly,B,[Magnetic Storm] Alpha,「磁気嵐」‐壱式,32,475,atk-p,20,,,,,,,,,,,,,,,状態異常蓄積値を蓄積させると、装備者の異常掌握+25/28/32/36/40Pt、継続時間10秒。20秒に1回のみ発動可能。
11,Anomaly,B,[Magnetic Storm] Bravo,「磁気嵐」‐弐式,32,475,anm-p,68,,,,,,,,,,,,,,,状態異常蓄積値を蓄積させると、装備者の異常マスタリー+25/28/32/36/40Pt、継続時間10秒。20秒に1回のみ発動可能。
12,Anomaly,B,[Magnetic Storm] Charlie,「磁気嵐」‐参式,32,475,pen-r,16,,,,,,,,,,,,,,,任意のメンバーが敵を状態異常にした時、装備者のエネルギーが3.5/4/4.5/5/5.5Pt回復する、12秒に1回のみ発動可能。
13,Defense,B,[Identity] Base,「恒等式」‐本格,32,475,def-p,32,,,,,,,,,,,,,,,敵の攻撃を受けた時、装備者の防御力+20/23/26/29/32%、継続時間8秒。
14,Defense,B,[Identity] Inflection,「恒等式」‐変格,32,475,def-p,32,,,,,,,,,,,,,,,敵の攻撃を受けた時、攻撃を仕掛けた敵の与ダメージ-6/7/8/9/10%、継続時間12秒。
15,Attack,A,Street Superstar,ストリートスター,40,594,atk-p,25,,,,,,,,,,,,,,,任意のメンバーが『連携スキル』を発動する度に、装備者にパワーを1重与える、最大3重まで重ね掛け可能。『終結スキル』を発動した時、すべてのパワーを消費し、パワー1重につき、スキルの与ダメージ+15/17.2/19.5/21.7/24%。
16,Support,A,Slice of Time,歳月の薄片,40,594,pen-r,20,,,,,,,,,,,,,,,任意のメンバーが『回避反撃』/『強化特殊スキル』/『支援攻撃』/『連携スキル』を発動した時、追加でデシベル値を20/23/26/29/32/25/28.5/32/35.5/40/30/34.5/39/43.5/48/35/40/45/50/55Pt獲得し、装備者のエネルギーが0.7/0.8/0.9/1/1.1Pt回復する、12秒に1回のみ発動可能。バフ効果のクールタイムはスキルごとに計算される。同じパッシブ効果は重ね掛け不可。
17,Anomaly,A,Rainforest Gourmet,密林の食いしん坊,40,594,anm-p,75,,,,,,,,,,,,,,,エネルギー値を10Pt消費するたびに、バフ効果を1重獲得する。バフ効果1重につき、装備者の攻撃力+2.5/2.8/3.2/3.6/4%、最大10重まで重ね掛け可能、継続時間10秒。継続時間は重ごとに独立してカウントされる。
18,Attack,A,Starlight Engine,スターライトエンジン,40,594,atk-p,25,,,,,,,,,,,,,,,『回避反撃』または『クイック支援』を発動した時、装備者の攻撃力+12/13.8/15.6/17.4/19.2%、継続時間12秒。
19,Stun,A,Steam Oven,まな板の鯉,40,594,en-reg,50,,,,,,,,,,,,,,,エネルギー値10Ptにつき、装備者の衝撃力+2/2.3/2.6/2.9/3.2%、最大8重まで重ね掛け可能。エネルギーが消費された後でも、効果が8秒持続する。継続時間は重ごとに独立してカウントされる。
20,Stun,A,Precious Fossilized Core,貴重な化石コア,40,594,imp-p,15,,,,,,,,,,,,,,,ターゲットのHPが50%以上の時、装備者の与えるブレイク値+10/11.5/13/14.5/16%。ターゲットのHPが75%以上の時、この効果が追加で+10/11.5/13/14.5/16%。
21,Defense,A,Original Transmorpher,正式版変身装置,40,594,hp-p,25,hp-p,8,9,10,11,12.5,,,,,,,,,HP上限+8/9/10/11/12.5%。敵の攻撃を受けた時、装備者の衝撃力+10/11.5/13/14.5/16%、継続時間12秒。
22,Anomaly,A,Weeping Gemini,双生の涙,40,594,atk-p,25,,,,,,,,,,,,,,,任意のメンバーが敵を状態異常にした時、装備者にバフ効果を1重与える。バフ効果1重につき、装備者の異常マスタリー+30/34/38/42/48Pt、最大4重まで重ね掛け可能。ターゲットがブレイク状態から復帰する、または死亡した時、バフ効果が終了する。継続時間は重ごとに独立してカウントされる。
23,Anomaly,A,Electro-Lip Gloss,電撃リップグロス,40,594,anm-p,75,,,,,,,,,,,,,,,フィールド上に状態異常の敵がいる時、装備者の攻撃力+10/11.5/13/14.5/16%、ターゲットに与えるダメージが追加で+15/17.5/20/22.5/25%。
24,Defense,A,Bunny Band,ラビットチャージャー,40,594,def-p,40,hp-p,8,9.2,10.4,11.6,12.8,,,,,,,,,HP上限+8/9.2/10.4/11.6/12.8%。シールドがある時、装備者の攻撃力+10/11.5/13/14.5/16%。
25,Defense,A,Spring Embrace,ホットスプリング,40,594,atk-p,25,,,,,,,,,,,,,,,自身の被ダメージ-7.5/8.5/9.5/10.5/12%。敵の攻撃を受けた時、装備者のエネルギー獲得効率+10/11.5/13/14.5/16%、継続時間12秒。装備者がキャラ切替で退場する時、この効果は操作中のメンバーに引き継がれ、継続時間も更新される。同じパッシブ効果は重ね掛け不可。
26,Support,A,The Vault,ザ・ボールト,42,624,en-reg,50,,,,,,,,,,,,,,,『強化特殊スキル』、『連携スキル』または『終結スキル』がエーテル属性ダメージを与えた時、チーム全体がターゲットに与えるダメージ+15/17.5/20/22/24%、装備者のエネルギー自動回復+0.5/0.58/0.65/0.72/0.8Pt/秒、継続時間2秒。同じパッシブ効果は重ね掛け不可。
27,Attack,A,Housekeeper,ハウスキーパー,42,624,atk-p,25,,,,,,,,,,,,,,,控えにいる時、装備者のエネルギー自動回復+0.45/0.52/0.58/0.65/0.72Pt/秒。『強化特殊スキル』が敵に命中すると、装備者の物理属性ダメージ+3/3.5/4/4.4/4.8%、最大15重まで重ね掛け可能、継続時間1秒。重複して発動すると継続時間が更新される。
28,Attack,A,Starlight Engine Replica,なんちゃってスターライトエンジン,42,624,atk-p,25,,,,,,,,,,,,,,,『通常攻撃』または『ダッシュ攻撃』が6メートル以上離れた敵に命中すると、装備者がターゲットに与える物理属性ダメージ+36/41/46.5/52/57.5%、継続時間8秒。
29,Attack,A,Drill Rig - Red Axis,ドリルリグ‐レッドシャフト,42,624,en-reg,50,,,,,,,,,,,,,,,『強化特殊スキル』または『連携スキル』を発動した時、『通常攻撃』と『ダッシュ攻撃』による電気属性ダメージ+50/57.5/65/72.5/80%、継続時間10秒。15秒に1回のみ発動可能。
30,Defense,A,Big Cylinder,ビガー・シリンダー,42,624,def-p,40,,,,,,,,,,,,,,,自身の被ダメージ-7.5/8.5/9.5/10.5/12%。敵の攻撃を受けた後、次の攻撃が敵に命中すると、装備者の防御力600/690/780/870/960%分のダメージを追加で与え、必ず会心が出る、7.5秒に1回のみ発動可能。
31,Support,A,Bashful Demon,恥じらう悪面,42,624,atk-p,25,bonus-ice,15,17.5,20,22,24,,,,,,,,,氷属性ダメージ+15/17.5/20/22/24%。『強化特殊スキル』を発動する度に、チーム全体の攻撃力+2/2.3/2.6/2.9/3.2%、最大4重まで重ね掛け可能、継続時間12秒。重複して発動すると継続時間が更新される。同じパッシブ効果は重ね掛け不可。
32,Attack,A,Cannon Rotor,キャノンローラー,40,594,crit-r,20,atk-p,7.5,8.6,9.7,10.8,12,,,,,,,,,攻撃力+7.5/8.6/9.7/10.8/12%。攻撃が敵に命中し、なおかつ会心が出た時、攻撃力200%分のダメージを追加で与える、8/7.5/7/6.5/6秒に1回のみ発動可能。
33,Support,A,Unfettered Game Ball,ゲームボール,40,594,en-reg,50,,,,,,,,,,,,,,,装備者の攻撃が敵に命中し、なおかつタイプの有利効果が発生した時、チーム全体の該当ターゲットに対する会心率+12/13.5/15.5/17.5/20%、継続時間12秒。同じパッシブ効果は重ね掛け不可。
34,Stun,A,Six Shooter,シックスシューター,40,594,imp-p,15,,,,,,,,,,,,,,,3秒ごとに装備者にパワーを1重与える、最大6重まで重ね掛け可能。『強化特殊スキル』を発動した時、すべてのパワーを消費し、パワー1重につき、スキルの与えるブレイク値+4/4.6/5.2/5.8/6.4%。
35,Attack,S,Steel Cushion,鋼の肉球,46,684,crit-r,24,bonus-phy,20,25,30,35,40,,,,,,,,,物理属性ダメージ+20/25/30/35/40%。敵を背後から攻撃し、なおかつ命中した時、装備者の与ダメージ+25/31.5/38/44/50%。
36,Attack,S,The Brimstone,ブリムストーン,46,684,atk-p,30,,,,,,,,,,,,,,,『通常攻撃』、『ダッシュ攻撃』または『回避反撃』が敵に命中すると、装備者の攻撃力+3.5/4.4/5.2/6/7%、最大8重まで重ね掛け可能、継続時間8秒。0.5秒に1回のみ発動可能、継続時間は重ごとに独立してカウントされる。
37,Stun,S,Helfire Gears,燃獄ギア,46,684,imp-p,18,,,,,,,,,,,,,,,控えにいる時、装備者のエネルギー自動回復+0.6/0.75/0.9/1.05/1.2Pt/秒。『強化特殊スキル』を発動する度に、装備者の衝撃力+10/12.5/15/17.5/20%、最大2重まで重ね掛け可能、継続時間10秒。継続時間は重ごとに独立してカウントされる。
38,Stun,S,The Restrained,束縛されし者,46,684,imp-p,18,,,,,,,,,,,,,,,攻撃が敵に命中した時、『通常攻撃』による与ダメージとブレイク値+6/7.5/9/10.5/12%、最大5重まで重ね掛け可能、継続時間8秒。1回の攻撃において、1回のみ発動可能。継続時間は重ごとに独立してカウントされる。
39,Anomaly,S,Fusion Compiler,複合コンパイラ,46,684,pen-r,24,atk-p,12,15,18,21,24,,,,,,,,,攻撃力+12/15/18/21/24%。『特殊スキル』または『強化特殊スキル』を発動する度に、装備者の異常マスタリー+25/31/37/43/50Pt、最大3重まで重ね掛け可能、継続時間8秒。継続時間は重ごとに独立してカウントされる。
40,Attack,S,Deep Sea Visitor,ディープシー・ビジター,48,713,crit-r,24,bonus-ice,25,31.5,38,44.5,50,,,,,,,,,氷属性ダメージ+25/31.5/38/44.5/50%。『通常攻撃』が敵に命中した時、装備者の会心率+10/12.5/15/17.5/20%、継続時間8秒。『ダッシュ攻撃』で氷属性ダメージを与えた時、装備者の会心率が追加で+10/12.5/15/17.5/20%、継続時間15秒、継続時間はバフ効果ごとに独立してカウントされる。
41,Support,S,Weeping Cradle,啜り泣くゆりかご,46,684,pen-r,24,,,,,,,,,,,,,,,控えにいる時、装備者のエネルギー自動回復+0.6/0.75/0.9/1.05/1.2Pt/秒。装備者の攻撃が敵に命中した時、チーム全体のターゲットに与えるダメージ+10/12.5/15/17.5/20%、継続時間3秒。効果継続中、0.5秒ごとにこのバフ効果が追加で+1.7/2/2.5/3/3.3%、最大10.2/12/15/18/19.8%まで。重複して発動すると、継続時間のみが更新され、ダメージアップ効果が更新されない。同じパッシブ効果は重ね掛け不可。
42,Attack,S,Riot Suppressor Mark VI,サプレッサーⅣ型,48,713,crit-d,48,crit-r,15,18.8,22.6,26.4,30,,,,,,,,,会心率+15/18.8/22.6/26.4/30%。『強化特殊スキル』を発動した時、装備者にパワーを8重与える、最大8重まで重ね掛け可能。『通常攻撃』でエーテル属性ダメージを与えた時、パワーを1重消費し、その攻撃の与ダメージ+35/43.5/52/60.5/70%。
43,Support,A,Kaboom the Cannon,喧嘩腰のボンバルダム,42,624,en-reg,50,,,,,,,,,,,,,,,チームにいる任意の味方ユニットの攻撃が敵に命中した時、すべての味方ユニットの攻撃力+2.5/2.8/3.2/3.6/4%、最大4重まで重ね掛け可能、継続時間8秒。継続時間は重ごとに独立してカウントされる。味方ユニット1名につき、1重のバフ効果を付与できる。同じパッシブ効果は重ね掛け不可。
44,Anomaly,A,Roaring Ride,グロウル・マイ・カー,42,624,atk-p,25,,,,,,,,,,,,,,,『強化特殊スキル』が敵に命中すると、以下の効果のいずれか1つが発動する、継続時間5秒、0.3秒に1回のみ発動可能。同じ効果は重ね掛け不可、重複して発動すると継続時間が更新される。異なる効果は併存可能。装備者の攻撃力+8/9.2/10.4/11.6/12.8%。装備者の異常マスタリー+40/46/52/58/64Pt。装備者の状態異常蓄積効率+25/28/32/36/40%。
45,Attack,A,Gilded Blossom,金メッキの花信,40,594,atk-p,25,atk-p,6,6.9,7.8,8.7,9.6,special,enhance,bonus-dmg,15,17.2,19.5,21.8,24,攻撃力+6/6.9/7.8/8.7/9.6%、『強化特殊スキル』の与ダメージ+15/17.2/19.5/21.8/24%。
46,Stun,S,Ice-Jade Teapot,玉壺青氷,48,713,imp-p,18,,,,,,,,,,,,,,,『通常攻撃』が敵に命中すると、「茶味」を1重獲得する。「茶味」1重につき、装備者の衝撃力+0.7/0.88/1.05/1.22/1.4%、最大30重まで重ね掛け可能、継続時間8秒。継続時間は重ごとに独立してカウントされる。「茶味」獲得時、装備者が持つ「茶味」が15以上の場合、チーム全体の与ダメージ+20/23/26/29/32%、継続時間10秒。同じパッシブ効果は重ね掛け不可。
47,Anomaly,S,Sharpened Stinger,磨き抜かれた切っ先,48,713,anm-p,90,,,,,,,,,,,,,,,『ダッシュ攻撃』を発動した時、「猟欲」を1重獲得する。「猟欲」1重につき、装備者の与える物理属性ダメージ+12/15/18/21/24%、最大3重まで重ね掛け可能、継続時間10秒。この効果は0.5秒に1回のみ発動可能、重複して発動すると継続時間が更新される。接敵状態突入時、または『極限回避』発動時、即座に「猟欲」を3重獲得する。「猟欲」の重数が上限に達すると、装備者の状態異常蓄積効率+40/50/60/70/80%。
48,Defense,A,Peacekeeper ‐ Specialized,秩序の守り手・特化型,42,624,atk-p,25,,,,,,,,,,,,,,,シールドがある時、装備者のエネルギー自動回復+0.4/0.46/0.52/0.58/0.64Pt/秒。『強化特殊スキル』と『支援突撃』による状態異常蓄積値+36/40/45/50/55%。
49,Defense,S,Tusks of Fury,猛進するキバ,48,713,imp-p,18,,,,,,,,,,,,,,,装備者のシールド生成量+30/38/46/52/60%。任意のメンバーが「看破」または『極限回避』を発動した時、チーム全体の与ダメージ+18/22.5/27/31.5/36%、与えるブレイク値+12/15/18/21/24%、継続時間20秒。同じパッシブ効果は重ね掛け不可。
50,Anomaly,S,Flamemaker Shaker,バーニング・シェイカー,48,713,atk-p,30,,,,,,,,,,,,,,,控えにいる時、装備者のエネルギー自動回復+0.6/0.75/0.9/1.05/1.2Pt/秒。『強化特殊スキル』または『支援攻撃』が敵に命中すると、装備者の与ダメージ+3.5/4.4/5.2/6.1/7%、最大10重まで重ね掛け可能、継続時間6秒、0.3秒に1回のみ発動可能。控えにいる時、重ね掛けの効率が2倍になる。重複して発動すると継続時間が更新される。ダメージアップ効果獲得時、所持している重数が5重以上の場合、追加で装備者の異常マスタリー+50/62/75/87/100Pt。異常マスタリーアップ効果は重ね掛け不可、継続時間6秒。
51,Anomaly,S,Timeweaver,刻流の賢者,48,713,atk-p,30,,,,,,,,,,,,,,,装備者の電気属性の状態異常蓄積効率+30/35/40/45/50%。『特殊スキル』または『強化特殊スキル』が状態異常の敵に命中すると、装備者の異常マスタリー+75/85/95/105/115Pt、継続時間15秒。装備者の異常マスタリーが375Pt以上の時、装備者による「混沌」ダメージ+25/27.5/30/32.5/35%。
52,Stun,S,Blazing Laurel,炎心の桂冠,48,713,imp-p,18,,,,,,,,,,,,,,,『クイック支援』または『極限支援』発動時、装備者の衝撃力+25/28.75/32.5/36.25/40%、継続時間8秒。装備者の『通常攻撃』が敵に命中すると、ターゲットに「衰耗」を1重付与する、最大20重まで重ね掛け可能、継続時間30秒、重複して発動すると継続時間が更新される。任意のメンバーの攻撃が敵に命中した時、ターゲットの「衰耗」1重につき、今回の攻撃による氷属性ダメージと炎属性ダメージの会心ダメージ+1.5/1.72/1.95/2.17/2.4%、該当効果はチーム内でひとつしか有効にならない。
53,Attack,A,Marcato Desire,強音デザイア,40,594,crit-r,20,,,,,,,,,,,,,,,『強化特殊スキル』または『連携スキル』が敵に命中すると、装備者の攻撃力+6/6.9/7.8/8.7/9.6%、継続時間8秒。ターゲットが状態異常の場合、この効果がさらに+6/6.9/7.8/8.7/9.6%。
54,Anomaly,S,Hailstorm Shrine,あられ落つ星殿,50,743,crit-r,24,crit-d,50,57,65,72,80,,,,,,,,,会心ダメージ+50/57/65/72/80%。『強化特殊スキル』発動時、または任意のメンバーが敵を状態異常にした時、装備者による氷属性ダメージ+20/23/26/29/32%、最大2重まで重ね掛け可能、継続時間15秒。継続時間は1重ごとに独立してカウントされる。
55,Attack,S,Zanshin Herb Case,残心の青籠,48,713,crit-d,48,crit-r,10,11.5,13,14.5,16,dodge,dash,bonus-ele,40,46,52,58,64,会心率+10/11.5/13/14.5/16%。『ダッシュ攻撃』による電気属性ダメージ+40/46/52/58/64%。任意のメンバーが敵を状態異常またはブレイク状態にした時、装備者の会心率が追加で+10/11.5/13/14.5/16%、継続時間15秒。
56,Support,S,Elegant Vanity,優美のヴァニティ,48,713,atk-p,30,,,,,,,,,,,,,,,任意のメンバーが『クイック支援』、『連携スキル』、『パリィ支援』、『回避支援』で出場した時、装備者のエネルギーを5/5.5/6/6.5/7Pt回復する、5秒に1回のみ発動可能。装備者がエネルギーを25Pt以上消費した時、チーム全体の与ダメージ+10/11.5/13/14.5/16%、最大2重まで重ね掛け可能、継続時間20秒、重複して発動すると継続時間が更新される、該当効果はチーム内でひとつしか有効にならない。
57,Attack,S,Heartstring Nocturne,心弦のノクターン,48,713,crit-r,24,crit-d,50,57.5,65,72.5,80,,,,,,,,,会心ダメージ+50/57.5/65/72.5/80%。フィールド入場時、『連携スキル』発動時および『終結スキル』発動時に、装備者が「心弦」を1重獲得する。「心弦」1重につき、装備者の『連携スキル』と『終結スキル』がターゲットの炎属性ダメージ耐性を12.5/14.5/16.5/18.5/20%無視する。最大2重まで重ね掛け可能、継続時間30秒、重複して発動すると継続時間が更新される。
58,Attack,S,Severed Innocence ,純然たる犠牲,48,713,crit-d,48,crit-d,30,34.5,39,43.5,48,,,,,,,,,会心ダメージ+30%/34.5%/39%/43.5%/48%。装備者の『通常攻撃』、『特殊スキル』、または『追加攻撃』が敵に命中した時、それぞれバフ効果を1重獲得する。バフ効果1重につき、装備者の会心ダメージが追加で+10%/11.5%/13%/14.5%/16%、最大3重まで重ね掛け可能、継続時間60秒。継続時間は1重ごとに独立してカウントされ、1回のスキルにおいて1回のみ発動可能。バフ効果を3重所持している場合、装備者による電気属性ダメージ+20%/23%/26%/29%/32%。
59,Stun,A,Box Cutter,ペーパーカッター,42,624,imp-p,15,,,,,,,,,,,,,,,『追加攻撃』を発動した時、装備者の与える物理属性ダメージ+15%/17.3%/19.5%/21.8%/24%、与えるブレイク値+10%/11.5%/13%/14.5%/16%、継続時間10秒。
`

const discDataCSV = `
0,Swing Jazz,スイング・ジャズ,en-reg,20,assist,,,,,,,,,,,,,,,,,,,,,,,,,,,
1,Woodpecker Electro,ウッドペッカー・エレクトロ,crit-r,8,attack,,,,,,,,,,,,,,,,,,,,,,,,,,,
2,Puffer Electro,パファー・エレクトロ,pen-r,8,attack,,,,,,,,,,,,,,,,,,,,,,,,,,,
3,Shockstar Disco,ショックスター・ディスコ,imp-p,6,stun,,,,,,,,,,,,,,,,,,,,,,,,,,,
4,Freedom Blues,フリーダム・ブルース,anm-p,30,anomaly,,,,,,,,,,,,,,,,,,,,,,,,,,,
5,Hormone Punk,ホルモン・パンク,atk-p,10,attack,,,,,,,,,,,,,,,,,,,,,,,,,,,
6,Soul Rock,ソウル・ロック,def-p,16,defense,,,,,,,,,,,,,,,,,,,,,,,,,,,
7,Inferno Metal,炎獄のヘヴィメタル,bonus-fire,10,dmg-bonus,,,,,,,,,,,,,,,,,,,,,,,,,,,
8,Chaotic Metal,混沌のヘヴィメタル,bonus-eth,10,dmg-bonus,,,,,,,,,,,,,,,,,,,,,,,,,,,
9,Thunder Metal,霹靂のヘヴィメタル,bonus-ele,10,dmg-bonus,,,,,,,,,,,,,,,,,,,,,,,,,,,
10,Polar Metal,極地のヘヴィメタル,bonus-ice,10,dmg-bonus,,,,,,,,,,,,,,,,,,,,,,,,,,,
11,Fanged Metal,獣牙のヘヴィメタル,bonus-phy,10,dmg-bonus,,,,,,,,,,,,,,,,,,,,,,,,,,,
12,Proto Punk,プロト・パンク,shield,15,shield,,,,,,,,,,,,,,,,,,,,,,,,,,,
13,Chaos Jazz,ケイオス・ジャズ,anm-p,30,anomaly,auto,self,none,none,none,bonus-fire,15,1,1,auto,self,none,none,none,bonus-ele,15,1,1,select,self,,,,,,,
14,Branch & Blade Song,折枝の刀歌,crit-d,16,anomaly,auto,self,anm-b,>,115,crit-d,30,1,1,select,self,none,none,none,crit-r,12,1,1,,,,,,,,,
15,Astral Voice,静寂のアストラ,atk-p,10,assist,select,team,none,none,none,bonus-dmg,8,1,3,,,,,,,,,,,,,,,,,,
16,Phaethon’s Melody,「パエトーン」の歌,anm-b,8,anomaly,select,self,none,none,none,anm-p,45,1,1,select,self,none,none,none,bonus-eth,25,1,1,,,,,,,,,
17,Shadow Harmony,シャドウハーモニー,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
`

const skillDataCSV = `
0,0,basic,normal,,ボルトターボ,TRUE,slash,Physical,31.2,1,2.9,slash,Physical,33.7,1,3.09999999999999,slash,Physical,113.6,1,10.4,slash,Electric,239.1,1,21.8,,,,,,,,,,
1,0,basic,derived,,落雷,TRUE,slash,Physical,31.2,1,2.9,slash,Physical,33.7,1,3.09999999999999,slash,Physical,113.6,1,10.4,strike,Electric,328.6,1,29.9,,,,,,,,,,
2,0,dodge,dash,,電弧斬り,FALSE,slash,Physical,56.7,1,5.2,,,,,,,,,,,,,,,,,,,,,,,,,
3,0,dodge,counter,,迅雷,FALSE,slash,Electric,180.2,1,16.4,,,,,,,,,,,,,,,,,,,,,,,,,
4,0,assist,quick,,雷呼,FALSE,slash,Electric,61.7,1,5.7,,,,,,,,,,,,,,,,,,,,,,,,,
5,0,assist,follow,,スピニングサンダー,FALSE,slash,Electric,335.2,1,30.5,,,,,,,,,,,,,,,,,,,,,,,,,
6,0,special,normal,,雷光斬り,FALSE,slash,Electric,93.4,1,8.5,,,,,,,,,,,,,,,,,,,,,,,,,
7,0,special,enhance,,蒼雷斬り,FALSE,slash,Electric,583,1,53,,,,,,,,,,,,,,,,,,,,,,,,,
8,0,chain,chain,,ソレノイドエンジン,FALSE,slash,Electric,542.4,1,49.4,,,,,,,,,,,,,,,,,,,,,,,,,
9,0,chain,ultimate,,オーバードライブエンジン,FALSE,slash,Electric,1512.6,1,137.6,,,,,,,,,,,,,,,,,,,,,,,,,
10,1,basic,normal,,出力全開,TRUE,pierce,Physical,68,1,6.2,pierce,Physical,7.6,1,0.700000000000001,pierce,Physical,61.8,1,5.7,pierce,Physical,12.7,1,1.2,pierce,Physical,61.8,1,5.7,pierce,Physical,49.5,1,4.5
11,1,dodge,dash,,スターライトジャッジメント,FALSE,pierce,Physical,63,1,5.8,pierce,Physical,39,1,3.6,,,,,,,,,,,,,,,,,,,,
12,1,dodge,counter,,フェアな決闘,FALSE,pierce,Physical,221.4,1,20.2,,,,,,,,,,,,,,,,,,,,,,,,,
13,1,assist,quick,,スターライト・絆の力,FALSE,pierce,Physical,93.4,1,8.5,,,,,,,,,,,,,,,,,,,,,,,,,
14,1,assist,follow,,急所エイム,FALSE,pierce,Physical,388.8,1,35.4,,,,,,,,,,,,,,,,,,,,,,,,,
15,1,special,normal,,大人しくしてろ！,TRUE,pierce,Physical,24.2,1,2.2,pierce,Physical,51.7,1,4.7,pierce,Physical,50.1,1,4.6,,,,,,,,,,,,,,,
16,1,special,derived,,スイーパー・タイム,FALSE,pierce,Physical,543.8,1,49.5,,,,,,,,,,,,,,,,,,,,,,,,,
17,1,chain,chain,,スターライトグローリー,FALSE,pierce,Physical,735.2,1,66.9,,,,,,,,,,,,,,,,,,,,,,,,,
18,1,chain,ultimate,,スターライト・ここに輝く！,FALSE,pierce,Physical,1597.7,1,145.3,,,,,,,,,,,,,,,,,,,,,,,,,
19,2,basic,normal,,邪兎の連打,TRUE,strike,Physical,38.9,1,3.6,strike,Physical,35.3,1,3.3,strike,Physical,124.3,1,11.3,,,,,,,,,,,,,,,
20,2,basic,normal,,邪兎の連打（弾）,TRUE,strike,Physical,9,3,0.800000000000001,strike,Physical,9,4,0.800000000000001,strike,Physical,9,20,0.800000000000001,,,,,,,,,,,,,,,
21,2,basic,enhance,,思うがままに(弾),TRUE,strike,Physical,16.4,3,1.5,strike,Physical,16.4,4,1.5,strike,Physical,16.4,20,1.5,,,,,,,,,,,,,,,
22,2,dodge,dash,,開けてびっくり（前方）,FALSE,strike,Physical,41.2,1,3.8,,,,,,,,,,,,,,,,,,,,,,,,,
23,2,dodge,dash,,開けてびっくり（前方/弾）,FALSE,strike,Physical,9,13,0.800000000000001,,,,,,,,,,,,,,,,,,,,,,,,,
24,2,dodge,dash,,開けてびっくり（後方）,FALSE,strike,Physical,60,1,5.5,,,,,,,,,,,,,,,,,,,,,,,,,
25,2,dodge,counter,,牽制砲撃,FALSE,strike,Physical,182.4,1,16.6,,,,,,,,,,,,,,,,,,,,,,,,,
26,2,assist,quick,,救急砲撃,FALSE,strike,Ether,63.4,1,5.8,,,,,,,,,,,,,,,,,,,,,,,,,
27,2,assist,follow,,邪兎の出番！,FALSE,strike,Ether,246.7,1,11.3,,,,,,,,,,,,,,,,,,,,,,,,,
28,2,special,normal,,シュガーボム,FALSE,strike,Ether,52.6,1,4.8,,,,,,,,,,,,,,,,,,,,,,,,,
29,2,special,enhance,,シュガーボムサンド,FALSE,strike,Ether,215,1,19.6,strike,Ether,215,1,19.6,strike,Ether,387,1,35.2,,,,,,,,,,,,,,,
30,2,chain,chain,,高級エーテルボム,FALSE,strike,Ether,209.6,1,19.2,strike,Ether,283,1,25.8,,,,,,,,,,,,,,,,,,,,
31,2,chain,ultimate,,特製エーテルグレネード,FALSE,strike,Ether,646.8,1,58.8000000000001,strike,Ether,873.2,1,79.4,,,,,,,,,,,,,,,,,,,,
32,24,basic,normal,,風花,TRUE,slash,Physical,26.9,1,2.5,slash,Physical,29.6,1,2.7,slash,Ice,62.8,1,5.8,slash,Ice,96.5,1,8.8,slash,Ice,129,1,11.8,,,,,
33,24,basic,charge,,霜月,FALSE,slash,Ice,454.7,1,41.4,slash,Ice,858.1,1,78.1,slash,Ice,2141.1,1,194.7,,,,,,,,,,,,,,,
34,24,dodge,dash,,冬蜂,FALSE,slash,Physical,25.8,1,2.4,,,,,,,,,,,,,,,,,,,,,,,,,
35,24,dodge,counter,,寒雀,FALSE,slash,Ice,245.9,1,22.4,,,,,,,,,,,,,,,,,,,,,,,,,
36,24,assist,quick,,花信風,FALSE,slash,Ice,104.5,1,9.5,,,,,,,,,,,,,,,,,,,,,,,,,
37,24,assist,follow,,返り花,FALSE,slash,Ice,337.8,1,30.8,,,,,,,,,,,,,,,,,,,,,,,,,
38,24,special,normal,,深雪,FALSE,slash,Ice,35.8,1,3.3,,,,,,,,,,,,,,,,,,,,,,,,,
39,24,special,enhance,,飛雪,TRUE,slash,Ice,393.4,1,35.9,slash,Ice,483.2,1,44.0000000000001,,,,,,,,,,,,,,,,,,,,
40,24,chain,chain,,春来たる,FALSE,slash,Ice,628,1,57.3,,,,,,,,,,,,,,,,,,,,,,,,,
41,24,chain,ultimate,,なごり雪,FALSE,slash,Ice,2388,1,217.1,,,,,,,,,,,,,,,,,,,,,,,,,
42,3,basic,normal,,猫の引っ掻き,TRUE,slash,Physical,55.2,1,5.09999999999999,slash,Physical,62.6,1,5.7,slash,Physical,72.7,1,6.7,slash,Physical,170.2,1,15.5,slash,Physical,123.6,1,11.3,,,,,
43,3,basic,derived,,赤き刃,TRUE,slash,Physical,71.8,1,6.60000000000001,,,,,,,,,,,,,,,,,,,,,,,,,
44,3,dodge,dash,,どこを見てるの？,FALSE,slash,Physical,35.1,1,3.2,,,,,,,,,,,,,,,,,,,,,,,,,
45,3,dodge,counter,,ファントムクロー,FALSE,slash,Physical,227.9,1,20.8,,,,,,,,,,,,,,,,,,,,,,,,,
46,3,assist,quick,,猫の手貸すぞ☆,FALSE,slash,Physical,94.5,1,8.59999999999999,,,,,,,,,,,,,,,,,,,,,,,,,
47,3,assist,follow,,迅影,FALSE,slash,Physical,300.4,1,27.4,,,,,,,,,,,,,,,,,,,,,,,,,
48,3,special,normal,,奇襲,FALSE,strike,Physical,47.3,1,4.3,,,,,,,,,,,,,,,,,,,,,,,,,
49,3,special,enhance,,めちゃコワ奇襲！,FALSE,slash,Physical,539.7,1,49.0999999999999,,,,,,,,,,,,,,,,,,,,,,,,,
50,3,chain,chain,,クロースワイプ,FALSE,slash,Physical,536.2,1,48.8,,,,,,,,,,,,,,,,,,,,,,,,,
51,3,chain,ultimate,,クロースマッシュ,FALSE,slash,Physical,1571.1,1,142.9,,,,,,,,,,,,,,,,,,,,,,,,,
52,4,basic,normal,,抜刀散火,TRUE,slash,Physical,34.4,1,3.2,slash,Physical,41.2,1,3.8,slash,Physical,102.8,1,9.40000000000001,slash,Physical,213.4,1,19.4,,,,,,,,,,
53,4,basic,enhance,,火力鎮圧,TRUE,slash,Fire,55.1,1,5.1,slash,Fire,57.2,1,5.2,slash,Fire,132,1,12,slash,Fire,340.7,1,31,,,,,,,,,,
54,4,dodge,dash,,熾火,FALSE,slash,Physical,68.3,1,6.3,,,,,,,,,,,,,,,,,,,,,,,,,
55,4,dodge,enhance,,火力鎮圧,FALSE,slash,Fire,78.8,1,7.2,,,,,,,,,,,,,,,,,,,,,,,,,
56,4,dodge,counter,,逆火,FALSE,slash,Fire,262,1,23.9,,,,,,,,,,,,,,,,,,,,,,,,,
57,4,assist,quick,,火力支援,FALSE,slash,Fire,120.8,1,11,,,,,,,,,,,,,,,,,,,,,,,,,
58,4,assist,follow,,再燃,FALSE,slash,Fire,383.7,1,34.9,,,,,,,,,,,,,,,,,,,,,,,,,
59,4,special,normal,,烈火,FALSE,slash,Fire,52.6,1,4.8,,,,,,,,,,,,,,,,,,,,,,,,,
60,4,special,enhance,,燃え盛る烈火,FALSE,slash,Fire,675,1,61.4,,,,,,,,,,,,,,,,,,,,,,,,,
61,4,chain,chain,,滾る烈火,FALSE,slash,Fire,632.5,1,57.5,,,,,,,,,,,,,,,,,,,,,,,,,
62,4,chain,ultimate,,轟く烈火,FALSE,slash,Fire,2103,1,191.2,,,,,,,,,,,,,,,,,,,,,,,,,
63,5,basic,normal,,お掃除開始,TRUE,slash,Physical,82,1,7.5,slash,Physical,76.6,1,7,slash,Physical,179.2,1,16.3,slash,Physical,233.4,1,21.3,slash,Physical,421.2,1,38.3,,,,,
64,5,dodge,dash,,『断』,FALSE,slash,Physical,96.7,1,8.8,,,,,,,,,,,,,,,,,,,,,,,,,
65,5,dodge,counter,,『捨』,FALSE,slash,Physical,271.2,1,24.8,,,,,,,,,,,,,,,,,,,,,,,,,
66,5,assist,quick,,応急処置,FALSE,slash,Physical,215,1,19.6,,,,,,,,,,,,,,,,,,,,,,,,,
67,5,assist,follow,,テキパキお掃除,FALSE,slash,Physical,547.5,1,49.8,,,,,,,,,,,,,,,,,,,,,,,,,
68,5,special,normal,,強力清掃,FALSE,slash,Physical,66.7,1,6.09999999999999,slash,Physical,37.5,1,3.5,slash,Physical,25,1,2.3,,,,,,,,,,,,,,,
69,5,special,enhance,,スカートの裾に注意,FALSE,slash,Physical,345.1,1,31.4,slash,Physical,1035.2,1,94.2000000000001,slash,Physical,345.1,1,31.4,,,,,,,,,,,,,,,
70,5,chain,chain,,ごめんなさい…,FALSE,slash,Physical,687.3,1,62.5,,,,,,,,,,,,,,,,,,,,,,,,,
71,5,chain,ultimate,,も、申し訳ございません！,FALSE,slash,Physical,2028.8,1,184.5,,,,,,,,,,,,,,,,,,,,,,,,,
72,6,basic,normal,,熱血準備体操,TRUE,strike,Physical,67.8,1,6.2,strike,Physical,92.3,1,8.40000000000001,strike,Physical,109.8,1,10,pierce,Physical,229.1,1,20.9,,,,,,,,,,
73,6,basic,enhance,,熱血準備体操（爆発状態）,TRUE,strike,Electric,240.9,1,21.9,pierce,Electric,469.2,1,42.7,pierce,Electric,456.9,1,41.6,,,,,,,,,,,,,,,
74,6,dodge,dash,,正面衝突,FALSE,strike,Physical,68.4,1,6.3,,,,,,,,,,,,,,,,,,,,,,,,,
75,6,dodge,counter,,拳骨応酬,FALSE,strike,Physical,271.2,1,24.7,,,,,,,,,,,,,,,,,,,,,,,,,
76,6,dodge,enhance,,オーバーロード・ドリルブレイク（爆発状態）,FALSE,pierce,Electric,465.4,1,42.4,,,,,,,,,,,,,,,,,,,,,,,,,
77,6,assist,quick,,肩を並べて,FALSE,strike,Physical,263.4,1,24,,,,,,,,,,,,,,,,,,,,,,,,,
78,6,assist,follow,,極限突進,FALSE,pierce,Electric,325.8,1,29.7,,,,,,,,,,,,,,,,,,,,,,,,,
79,6,special,normal,,回れ、兄弟！,FALSE,pierce,Electric,44.2,1,4.09999999999999,,,,,,,,,,,,,,,,,,,,,,,,,
80,6,special,enhance,,バースト・ドリルブレイク（爆発状態）,FALSE,pierce,Electric,231.4,1,21.1,,,,,,,,,,,,,,,,,,,,,,,,,
81,6,special,enhance,,兄弟、天を衝け！,FALSE,pierce,Electric,195.1,1,17.8,,,,,,,,,,,,,,,,,,,,,,,,,
82,6,chain,chain,,回れ回れ！,FALSE,pierce,Electric,640.7,1,58.3,,,,,,,,,,,,,,,,,,,,,,,,,
83,6,chain,ultimate,,回れ！回れ！！回れ！！！,FALSE,pierce,Electric,1816.4,1,165.2,,,,,,,,,,,,,,,,,,,,,,,,,
84,7,basic,normal,,帳尻合わせ,TRUE,strike,Physical,65.9,1,6,strike,Physical,189,1,17.2,strike,Physical,348.3,1,31.7,,,,,,,,,,,,,,,
85,7,dodge,dash,,経費で落とす,FALSE,strike,Physical,138.4,1,12.6,,,,,,,,,,,,,,,,,,,,,,,,,
86,7,dodge,counter,,精算,FALSE,strike,Fire,225.7,1,20.6,,,,,,,,,,,,,,,,,,,,,,,,,
87,7,assist,quick,,共同取り立て,FALSE,strike,Fire,96.7,1,8.8,,,,,,,,,,,,,,,,,,,,,,,,,
88,7,assist,follow,,債務不履行罰則,FALSE,strike,Fire,325.9,1,29.7,,,,,,,,,,,,,,,,,,,,,,,,,
89,7,special,normal,,債「拳」格付,FALSE,strike,Physical,41.7,1,3.8,strike,Physical,233.4,1,21.3,,,,,,,,,,,,,,,,,,,,
90,7,special,enhance,,債「拳」弁砕,FALSE,strike,Fire,438.5,1,39.9,strike,Fire,438.5,1,39.9,,,,,,,,,,,,,,,,,,,,
91,7,special,enhance,,債「拳」弁砕(ガード),FALSE,strike,Fire,500.5,1,45.5,strike,Fire,552.2,1,49.1999999999999,,,,,,,,,,,,,,,,,,,,
92,7,chain,chain,,押印、決裁,FALSE,strike,Fire,627.3,1,57.1,,,,,,,,,,,,,,,,,,,,,,,,,
93,7,chain,ultimate,,債「拳」、利息付き弁砕,FALSE,strike,Fire,1643,1,149.4,,,,,,,,,,,,,,,,,,,,,,,,,
94,8,basic,normal,,打ち砕いて、ぶちのめす,TRUE,strike,Physical,63.6,1,5.8,strike,Physical,79.2,1,7.2,strike,Physical,126.1,1,11.5,strike,Physical,317.4,1,28.9,,,,,,,,,,
95,8,basic,enhance,,打ち砕いて、ぶちのめす(熔炉昇温),TRUE,strike,Physical,63.6,1,5.8,strike,Physical,79.2,1,7.2,strike,Fire,160.8,1,14.7,strike,Fire,404.8,1,37,,,,,,,,,,
96,8,basic,enhance,,打ち砕いて、ぶちのめす(協力攻撃),TRUE,strike,Physical,63.6,1,5.8,strike,Physical,79.2,1,7.2,strike,Fire,160.8,1,14.7,strike,Fire,501.3,1,45.6,,,,,,,,,,
97,8,dodge,dash,,震えろ,FALSE,strike,Physical,56.1,1,5.1,,,,,,,,,,,,,,,,,,,,,,,,,
98,8,dodge,counter,,見くびるな！,FALSE,strike,Fire,343.9,1,31.3,,,,,,,,,,,,,,,,,,,,,,,,,
99,8,assist,quick,,あたしがやる！,FALSE,strike,Fire,183.8,1,16.8,,,,,,,,,,,,,,,,,,,,,,,,,
100,8,assist,follow,,鐘打,FALSE,strike,Fire,359.2,1,32.7,,,,,,,,,,,,,,,,,,,,,,,,,
101,8,special,normal,,爆破！ハンマータイム,FALSE,strike,Fire,51.9,1,4.8,strike,Fire,77.8,1,7.10000000000001,strike,Fire,85.5,1,7.8,,,,,,,,,,,,,,,
102,8,special,enhance,,沸騰溶炉,FALSE,strike,Fire,152.3,1,13.9,strike,Fire,606,1,55.1,strike,Fire,666.6,1,60.6,,,,,,,,,,,,,,,
103,8,chain,chain,,天崩・地裂,FALSE,strike,Fire,636,1,57.9,,,,,,,,,,,,,,,,,,,,,,,,,
104,8,chain,ultimate,,地の底にぶちこんでやる！,FALSE,strike,Fire,1548.8,1,140.8,,,,,,,,,,,,,,,,,,,,,,,,,
105,8,chain,ultimate,,地の底にぶちこんでやる！(協力攻撃),FALSE,strike,Fire,1694,1,154,,,,,,,,,,,,,,,,,,,,,,,,,
106,9,basic,normal,,高圧ネイルガン,TRUE,pierce,Physical,55.1,1,5.1,pierce,Physical,59.7,1,5.5,pierce,Electric,124.8,1,11.4,pierce,Electric,186.3,1,17,,,,,,,,,,
107,9,basic,derived,,高圧ネイルガン(ステップ射撃),FALSE,pierce,Electric,40.3,1,3.7,,,,,,,,,,,,,,,,,,,,,,,,,
108,9,dodge,dash,,抜き打ち検査,FALSE,pierce,Physical,33.3,1,3.1,,,,,,,,,,,,,,,,,,,,,,,,,
109,9,dodge,counter,,違反罰則,FALSE,pierce,Electric,164.2,1,15,,,,,,,,,,,,,,,,,,,,,,,,,
110,9,assist,quick,,ヒヤリハット対策,FALSE,strike,Electric,45.5,1,4.2,,,,,,,,,,,,,,,,,,,,,,,,,
111,9,assist,follow,,反撃の電気針,FALSE,pierce,Electric,359.3,1,32.7,,,,,,,,,,,,,,,,,,,,,,,,,
112,9,special,normal,,障害撤去,FALSE,strike,Electric,42.1,1,3.9,,,,,,,,,,,,,,,,,,,,,,,,,
113,9,special,enhance,,規格外障害撤去,FALSE,strike,Electric,166.9,2,15.2,,,,,,,,,,,,,,,,,,,,,,,,,
114,9,chain,chain,,共同施工,FALSE,strike,Electric,571.3,1,52,,,,,,,,,,,,,,,,,,,,,,,,,
115,9,chain,ultimate,,発破作業中立入禁止,FALSE,strike,Electric,1478.8,1,134.5,,,,,,,,,,,,,,,,,,,,,,,,,
116,10,basic,normal,,月下遊猟,TRUE,strike,Physical,29.2,1,2.7,strike,Physical,37.1,1,3.4,strike,Physical,58.4,1,5.4,strike,Physical,152,1,13.9,strike,Physical,180.7,1,16.5,,,,,
117,10,basic,derived,,月下遊猟(チャージ),TRUE,strike,Ice,37.1,1,3.4,strike,Ice,56.4,1,5.2,strike,Ice,99.5,1,9.09999999999999,strike,Ice,210.9,1,19.2,strike,Ice,277.6,1,25.3,strike,Ice,355.7,1,32.4
118,10,dodge,dash,,清潔を保つ,FALSE,strike,Physical,47.3,1,4.3,,,,,,,,,,,,,,,,,,,,,,,,,
119,10,dodge,counter,,礼儀の躾,FALSE,strike,Ice,187,1,17,,,,,,,,,,,,,,,,,,,,,,,,,
120,10,assist,quick,,群狼,FALSE,strike,Ice,63.1,1,5.8,,,,,,,,,,,,,,,,,,,,,,,,,
121,10,assist,follow,,復讐の反攻,FALSE,strike,Ice,288.3,1,26.3,,,,,,,,,,,,,,,,,,,,,,,,,
122,10,special,normal,,狩人の刻,FALSE,strike,Ice,77.1,1,7.10000000000001,,,,,,,,,,,,,,,,,,,,,,,,,
123,10,special,normal,,狩人の刻(チャージ),FALSE,strike,Ice,133.1,1,12.2,,,,,,,,,,,,,,,,,,,,,,,,,
124,10,special,enhance,,人狼の刻,FALSE,strike,Ice,534.3,1,48.7,,,,,,,,,,,,,,,,,,,,,,,,,
125,10,special,enhance,,人狼の刻(チャージ),FALSE,strike,Ice,789.5,1,71.9,,,,,,,,,,,,,,,,,,,,,,,,,
126,10,chain,chain,,御意に,FALSE,strike,Ice,637.8,1,58,,,,,,,,,,,,,,,,,,,,,,,,,
127,10,chain,ultimate,,使命を果たす,FALSE,strike,Ice,1694.1,1,154.1,,,,,,,,,,,,,,,,,,,,,,,,,
128,11,basic,normal,,鋭牙剪定法,TRUE,slash,Physical,48.8,1,4.5,slash,Physical,111.1,1,10.1,slash,Physical,297.3,1,27.1,,,,,,,,,,,,,,,
129,11,basic,enhance,,急凍剪定法,TRUE,slash,Ice,99.6,1,9.10000000000001,slash,Ice,184,1,16.7,slash,Ice,496.2,1,45.2,,,,,,,,,,,,,,,
130,11,dodge,dash,,荒波,FALSE,slash,Physical,77,1,7,,,,,,,,,,,,,,,,,,,,,,,,,
131,11,dodge,dash,,寒潮,FALSE,slash,Ice,145.7,1,13.3,,,,,,,,,,,,,,,,,,,,,,,,,
132,11,dodge,dash,,薄氷の急襲,FALSE,slash,Ice,62.3,1,5.7,slash,Ice,127.6,1,11.6,,,,,,,,,,,,,,,,,,,,
133,11,dodge,dash,,薄氷の急襲(チャージ),FALSE,slash,Ice,62.3,1,5.7,slash,Ice,158.2,1,14.4,,,,,,,,,,,,,,,,,,,,
134,11,dodge,counter,,暗礁,FALSE,slash,Ice,152.6,1,13.9,,,,,,,,,,,,,,,,,,,,,,,,,
135,11,assist,quick,,護衛シャーク,FALSE,slash,Ice,121.1,1,11.1,,,,,,,,,,,,,,,,,,,,,,,,,
136,11,assist,follow,,巡洋シャーク,FALSE,slash,Ice,437.9,1,39.9,,,,,,,,,,,,,,,,,,,,,,,,,
137,11,special,normal,,尾びれビンタ,FALSE,strike,Ice,50.5,1,4.6,,,,,,,,,,,,,,,,,,,,,,,,,
138,11,special,enhance,,一掃,FALSE,strike,Ice,377.2,1,34.3,,,,,,,,,,,,,,,,,,,,,,,,,
139,11,special,enhance,,シャーク・トルネード,FALSE,slash,Ice,553.3,1,50.3000000000001,,,,,,,,,,,,,,,,,,,,,,,,,
140,11,chain,chain,,雪崩,FALSE,slash,Ice,794.6,1,72.3,,,,,,,,,,,,,,,,,,,,,,,,,
141,11,chain,ultimate,,終わりなき冬の狂宴,FALSE,slash,Ice,1890.8,1,171.9,,,,,,,,,,,,,,,,,,,,,,,,,
142,12,basic,normal,,アホを痛めつけろ,TRUE,strike,Physical,44,1,4,strike,Physical,111.4,1,10.2,strike,Electric,117.1,1,10.7,strike,Electric,183.9,1,16.8,,,,,,,,,,
143,12,basic,derived,,マヌケを追い払え,FALSE,strike,Electric,315.1,1,28.7,,,,,,,,,,,,,,,,,,,,,,,,,
144,12,dodge,dash,,いきなりビックリ,FALSE,pierce,Physical,105,1,9.59999999999999,,,,,,,,,,,,,,,,,,,,,,,,,
145,12,dodge,counter,,ボンプ回生,FALSE,strike,Electric,227.6,1,20.7,,,,,,,,,,,,,,,,,,,,,,,,,
146,12,assist,quick,,二拍子のアルマンド,FALSE,strike,Electric,122.6,1,11.2,,,,,,,,,,,,,,,,,,,,,,,,,
147,12,assist,follow,,四拍子のガヴォット,FALSE,strike,Electric,349.4,1,31.8,,,,,,,,,,,,,,,,,,,,,,,,,
148,12,special,normal,,おバカをぶっ叩け,FALSE,strike,Electric,61.3,1,5.60000000000001,,,,,,,,,,,,,,,,,,,,,,,,,
149,12,special,enhance,,おバカ消失魔法,FALSE,strike,Electric,546,1,49.7,,,,,,,,,,,,,,,,,,,,,,,,,
150,12,chain,chain,,侍者の心得,FALSE,strike,Electric,1013,1,92.0999999999999,,,,,,,,,,,,,,,,,,,,,,,,,
151,12,chain,ultimate,,女王の侍従たち,FALSE,strike,Electric,2116.7,1,192.5,,,,,,,,,,,,,,,,,,,,,,,,,
`